print(5)
print(type(5))#int - integer - целое число
print('5')
print(type('5'))
print(5+5)
print(5*5)# - умножение
print(5/5)# - деление
print(5//5)# -  целочисленное деление
print(type(5/5))
print(5%4)# - статок деления
print(5**5)# - возведение в степень
print(type('Hello, "World"'))#'str' - string - строка, если надо вывасти текст в ковычках, они должны отличаться от командных ковычек(одинарные и двойные)
print('1'+'1')# нельзя сложить строку и число? если сложить строку со строкой, они склеиваются
print(type(True),type(False))#bool - boolen - логический тип
print(5>10)
print(5<10)
print(5!=10)
print(5==10)#авно пишем двумя знаками
print(5<10,5>10,5==10,5!=10)
print(type(int('5')))